<a href="https://colab.research.google.com/github/sunilsm7/pandas_starter/blob/main/Indexing%2C_Selecting_%26_Assigning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Indexing, Selecting & Assigning

Selecting specific values of a pandas DataFrame or Series to work on is an implicit step in almost any data operation you'll run, so one of the first things you need to learn in working with data in Python is how to go about selecting the data points relevant to you quickly and effectively.

In [1]:
import pandas as pd

In [4]:
california_housing = pd.read_csv("./sample_data/california_housing_test.csv")

## Native accessors

Native Python objects provide good ways of indexing data. Pandas carries all of these over, which helps make it easy to start with.

Consider this DataFrame:

In [5]:
california_housing

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In Python, we can access the property of an object by accessing it as an attribute. A `book` object, for example, might have a `title` property, which we can access by calling `book.title`. Columns in a pandas DataFrame work in much the same way.

Hence to access the `population` property of `california_housing` we can use:

In [12]:
california_housing.population

0       1537.0
1        809.0
2       1484.0
3         49.0
4        850.0
         ...
2995    1258.0
2996    3496.0
2997     693.0
2998      46.0
2999     753.0
Name: population, Length: 3000, dtype: float64

If we have a Python dictionary, we can access its values using the indexing (`[]`) operator. We can do the same with columns in a DataFrame:

In [13]:
california_housing['population']

0       1537.0
1        809.0
2       1484.0
3         49.0
4        850.0
         ...
2995    1258.0
2996    3496.0
2997     693.0
2998      46.0
2999     753.0
Name: population, Length: 3000, dtype: float64

These are the two ways of selecting a specific Series out of a DataFrame. Neither of them is more or less syntactically valid than the other, but the indexing operator `[]` does have the advantage that it can handle column names with reserved characters in them.

Doesn't a pandas Series look kind of like a fancy dictionary? It pretty much is, so it's no surprise that, to drill down to a single specific value, we need only use the indexing operator `[]` once more:

In [15]:
california_housing['population'][0]

1537.0

## Indexing in pandas

The indexing operator and attribute selection are nice because they work just like they do in the rest of the Python ecosystem. As a novice, this makes them easy to pick up and use. However, pandas has its own accessor operators, `loc` and `iloc`. For more advanced operations, these are the ones you're supposed to be using.

### Index-based selection

Pandas indexing works in one of two paradigms. The first is **index-based selection**: selecting data based on its numerical position in the data. `iloc` follows this paradigm.

To select the first row of data in a DataFrame, we may use the following:

In [17]:
california_housing.iloc[0]

longitude               -122.0500
latitude                  37.3700
housing_median_age        27.0000
total_rooms             3885.0000
total_bedrooms           661.0000
population              1537.0000
households               606.0000
median_income              6.6085
median_house_value    344700.0000
Name: 0, dtype: float64

Both `loc` and `iloc` are row-first, column-second. This is the opposite of what we do in native Python, which is column-first, row-second.

This means that it's marginally easier to retrieve rows, and marginally harder to get retrieve columns. To get a column with `iloc`, we can do the following:

In [20]:
california_housing.iloc[:, 0]

0      -122.05
1      -118.30
2      -117.81
3      -118.36
4      -119.67
         ...
2995   -119.86
2996   -118.14
2997   -119.70
2998   -117.12
2999   -119.63
Name: longitude, Length: 3000, dtype: float64

On its own, the `:` operator, which also comes from native Python, means "everything". When combined with other selectors, however, it can be used to indicate a range of values. For example, to select the population column from just the first, second, and third row, we would do:

In [22]:
california_housing.iloc[:3, 5]

0    1537.0
1     809.0
2    1484.0
Name: population, dtype: float64

Or, to select just the second and third entries, we would do:

In [23]:
california_housing.iloc[1:3, 5]

1     809.0
2    1484.0
Name: population, dtype: float64

It's also possible to pass a list:

In [24]:
california_housing.iloc[[0, 1, 2], 5]

0    1537.0
1     809.0
2    1484.0
Name: population, dtype: float64

Finally, it's worth knowing that negative numbers can be used in selection. This will start counting forwards from the end of the values. So for example here are the last five elements of the dataset.

In [25]:
california_housing.iloc[-5:]

      longitude  latitude  ...  median_income  median_house_value
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[5 rows x 9 columns]

### Label-based selection

The second paradigm for attribute selection is the one followed by the `loc` operator: label-based selection. In this paradigm, it's the data index value, not its position, which matters.

For example, to get the first entry in `california_housing`, we would now do the following:

In [26]:
california_housing.loc[0, 'population']

1537.0

`iloc` is conceptually simpler than `loc` because it ignores the dataset's indices. When we use iloc we treat the dataset like a big matrix (a list of lists), one that we have to index into by position. `loc`, by contrast, uses the information in the indices to do its work. Since your dataset usually has meaningful indices, it's usually easier to do things using `loc` instead. For example, here's one operation that's much easier using `loc`:

In [27]:
california_housing.loc[:, ['population', 'households', 'housing_median_age']]

      population  households  housing_median_age
0         1537.0       606.0                27.0
1          809.0       277.0                43.0
2         1484.0       495.0                27.0
3           49.0        11.0                28.0
4          850.0       237.0                19.0
...          ...         ...                 ...
2995      1258.0       607.0                23.0
2996      3496.0      1036.0                27.0
2997       693.0       220.0                10.0
2998        46.0        14.0                40.0
2999       753.0       260.0                42.0

[3000 rows x 3 columns]

### Manipulating the index

Label-based selection derives its power from the labels in the index. Critically, the index we use is not immutable. We can manipulate the index in any way we see fit.

The `set_index()` method can be used to do the job. Here is what happens when we `set_index` to the `longitude` field:

In [28]:
california_housing.set_index("longitude")

           latitude  housing_median_age  ...  median_income  median_house_value
longitude                                ...
-122.05       37.37                27.0  ...         6.6085            344700.0
-118.30       34.26                43.0  ...         3.5990            176500.0
-117.81       33.78                27.0  ...         5.7934            270500.0
-118.36       33.82                28.0  ...         6.1359            330000.0
-119.67       36.33                19.0  ...         2.9375             81700.0
...             ...                 ...  ...            ...                 ...
-119.86       34.42                23.0  ...         1.1790            225000.0
-118.14       34.06                27.0  ...         3.3906            237200.0
-119.70       36.30                10.0  ...         2.2895             62000.0
-117.12       34.10                40.0  ...         3.2708            162500.0
-119.63       34.42                42.0  ...         8.5608            500001.0

[3000 rows x 8 columns]

### Conditional selection

So far we've been indexing various strides of data, using structural properties of the DataFrame itself. To do interesting things with the data, however, we often need to ask questions based on conditions.

For example, suppose that we're interested specifically in housing in particular latitude.

In [30]:
california_housing.latitude == 37

0       False
1       False
2       False
3       False
4       False
        ...
2995    False
2996    False
2997    False
2998    False
2999    False
Name: latitude, Length: 3000, dtype: bool

This operation produced a Series of `True/False` booleans based on the `latitude` of each record. This result can then be used inside of `loc` to select the relevant data:

In [31]:
california_housing.loc[california_housing.latitude == 37]

      longitude  latitude  ...  median_income  median_house_value
807     -121.79      37.0  ...         4.8021            290400.0
1826    -122.04      37.0  ...         2.9712            116600.0
1878    -121.57      37.0  ...         4.5714            260300.0
2713    -120.09      37.0  ...         3.4598             74600.0
2767    -121.56      37.0  ...         2.5387            160100.0
2922    -121.96      37.0  ...         3.3447            305200.0

[6 rows x 9 columns]

We can use the ampersand (`&`) to bring the two questions together:

In [34]:
california_housing.loc[(california_housing.latitude == 37) & (california_housing.population <= 1000)]

      longitude  latitude  ...  median_income  median_house_value
1826    -122.04      37.0  ...         2.9712            116600.0

[1 rows x 9 columns]

For OR questions we use a pipe (`|`):

In [35]:
california_housing.loc[(california_housing.latitude == 37) | (california_housing.population <= 1000)]

      longitude  latitude  ...  median_income  median_house_value
1       -118.30     34.26  ...         3.5990            176500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
5       -119.56     36.51  ...         1.6635             67000.0
6       -121.43     38.63  ...         1.6641             67000.0
...         ...       ...  ...            ...                 ...
2993    -117.91     33.60  ...         5.1048            500001.0
2994    -117.93     33.86  ...         5.5867            182500.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[1207 rows x 9 columns]

Pandas comes with a few built-in conditional selectors, two of which we will highlight here.

The first is `isin`. `isin` is lets you select data whose value "is in" a list of values. For example, here's how we can use it to select wines only from Italy or France:

In [37]:
california_housing.loc[california_housing.housing_median_age.isin([28, 35])]

      longitude  latitude  ...  median_income  median_house_value
3       -118.36     33.82  ...         6.1359            330000.0
19      -122.59     38.01  ...         6.1724            414300.0
62      -118.41     34.00  ...         2.7153            265500.0
69      -117.97     33.86  ...         3.5855            174300.0
82      -118.44     34.25  ...         3.7000            176000.0
...         ...       ...  ...            ...                 ...
2937    -122.08     37.35  ...         7.7068            500001.0
2944    -121.89     37.28  ...         6.0936            365400.0
2947    -123.02     38.81  ...         3.0250            140600.0
2976    -118.31     34.05  ...         2.5313            305800.0
2994    -117.93     33.86  ...         5.5867            182500.0

[176 rows x 9 columns]

The second is `isnull` (and its companion `notnull`). These methods let you highlight values which are (or are not) empty (`NaN`). For example, to filter out wines lacking a price tag in the dataset, here's what we would do:

In [38]:
california_housing.loc[california_housing.households.notnull()]

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

### Assigning data

Assigning data

In [39]:
california_housing['total_rooms'] = 2000
california_housing['total_rooms']

0       2000
1       2000
2       2000
3       2000
4       2000
        ...
2995    2000
2996    2000
2997    2000
2998    2000
2999    2000
Name: total_rooms, Length: 3000, dtype: int64